sridhar2rok/test/boards/QN9090_SR040_TR3_SPI/pin_mux.c
/*
 * Copyright  2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v6.0
processor: QN9090
package_id: QN9090HN
mcu_data: ksdk2_0
processor_version: 0.0.1
pin_labels:
- {pin_num: '13', pin_signal: PIO0_10/CT32B0_CAP0/USART1_TXD/RFTX/I2C0_SCL/SPI0_SCK/PDM0_DATA, label: DBG_UART_TX, identifier: DBG_UART_TX}
- {pin_num: '14', pin_signal: PIO0_11/CT32B1_CAP0/USART1_RXD/RFRX/I2C0_SDA/SPI0_MISO/PDM0_CLK, label: DBG_UART_RX, identifier: DBG_UART_RX}
- {pin_num: '11', pin_signal: PIO0_8/SPI0_MOSI/USART0_TXD/CT32B0_MAT0/PWM8/ANA_COMP_OUT/RFTX/PDM1_DATA, label: APP_UART_TX, identifier: APP_UART_TX}
- {pin_num: '12', pin_signal: PIO0_9/SPI0_SSELN/USART0_RXD/CT32B1_CAP1/PWM9/USART1_SCK/ADO/PDM1_CLK, label: APP_UART_RX, identifier: APP_UART_RX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */
#include "UWBT_BuildConfig.h"
#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"
#include "board.h"

#include "driver_config.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDebugUARTPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '13', peripheral: USART1, signal: TXD, pin_signal: PIO0_10/CT32B0_CAP0/USART1_TXD/RFTX/I2C0_SCL/SPI0_SCK/PDM0_DATA, invert: disabled, open_drain: disabled,
    filter_off: disabled, egp: gpio, ecs: disabled, ehs: low, fsel: disabled, io_clamp: disabled}
  - {pin_num: '14', peripheral: USART1, signal: RXD, pin_signal: PIO0_11/CT32B1_CAP0/USART1_RXD/RFRX/I2C0_SDA/SPI0_MISO/PDM0_CLK, invert: disabled, open_drain: disabled,
    filter_off: disabled, egp: gpio, ecs: disabled, ehs: low, fsel: disabled, io_clamp: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDebugUARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void BOARD_InitSwoPins(void)
{
    if (IS_DEBUG_SESSION) {
        const uint32_t swoCfg = (/* Pin is configured as SWO */
            SWO_FUN |
            /* Selects pull-up function */
            IOCON_PIO_MODE_PULLUP |
            /* Standard mode, output slew rate control is disabled */
            IOCON_PIO_SLEW0_STANDARD |
            /* Input function is not inverted */
            IOCON_PIO_INV_DI |
            /* Enables digital function */
            IOCON_PIO_DIGITAL_EN |
            /* Input filter disabled */
            IOCON_PIO_INPFILT_OFF |
            /* Standard mode, output slew rate control is disabled */
            IOCON_PIO_SLEW1_STANDARD |
            /* Open drain is disabled */
            IOCON_PIO_OPENDRAIN_DI |
            /* SSEL is disabled */
            IOCON_PIO_SSEL_DI);
        /* PORT0 PIN14  is configured as SWO */
        IOCON_PinMuxSet(IOCON, SWO_PORT, SWO_PIN, swoCfg);
    }

    const uint32_t uartTxCfg = (UWB_UART_TX_FUN |
                                /* Selects pull-up function */
                                IOCON_PIO_MODE_PULLUP |
                                /* Standard mode, output slew rate control is disabled */
                                IOCON_PIO_SLEW0_STANDARD |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is disabled */
                                IOCON_PIO_SLEW1_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI |
                                /* SSEL is disabled */
                                IOCON_PIO_SSEL_DI);

    const uint32_t uartRxCfg = (UWB_UART_RX_FUN |
                                /* Selects pull-up function */
                                IOCON_PIO_MODE_PULLUP |
                                /* Standard mode, output slew rate control is disabled */
                                IOCON_PIO_SLEW0_STANDARD |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is disabled */
                                IOCON_PIO_SLEW1_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI |
                                /* SSEL is disabled */
                                IOCON_PIO_SSEL_DI);

    IOCON_PinMuxSet(IOCON, UWB_UART_TX_PORT, UWB_UART_TX_PIN, uartTxCfg);
    IOCON_PinMuxSet(IOCON, UWB_UART_RX_PORT, UWB_UART_RX_PIN, uartRxCfg);
}

