sridhar2rok/test/boards/QN9090_SR040_TR3_SPI/pin_mux.c
void BOARD_InitHeliosPins(void)
{
    const uint32_t sckCfg = (UWB_HELIOS_CLK_FUN |
                             /* IOCON_PIO_MODE_PULLUP |*/
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW0_STANDARD |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW1_STANDARD |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI |
                             /* SSEL is disabled */
                             IOCON_PIO_SSEL_DI);

    const uint32_t misoCfg = (UWB_HELIOS_MISO_FUN |
                              /* Selects pull-up function */
                              IOCON_PIO_MODE_PULLUP |
                              /* Standard mode, output slew rate control is disabled */
                              IOCON_PIO_SLEW0_STANDARD |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Standard mode, output slew rate control is disabled */
                              IOCON_PIO_SLEW1_STANDARD |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI |
                              /* SSEL is disabled */
                              IOCON_PIO_SSEL_DI);

    const uint32_t mosiCfg = (UWB_HELIOS_MOSI_FUN |
                              /* Selects pull-up function */
                              IOCON_PIO_MODE_PULLUP |
                              /* Standard mode, output slew rate control is disabled */
                              IOCON_PIO_SLEW0_STANDARD |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Standard mode, output slew rate control is disabled */
                              IOCON_PIO_SLEW1_STANDARD |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI |
                              /* SSEL is disabled */
                              IOCON_PIO_SSEL_DI);

    const uint32_t csCfg = (UWB_HELIOS_CS_FUN |
                            /* Selects pull-up function */
                            IOCON_PIO_MODE_PULLDOWN |
                            /* Standard mode, output slew rate control is disabled */
                            IOCON_PIO_SLEW0_STANDARD |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Standard mode, output slew rate control is disabled */
                            IOCON_PIO_SLEW1_STANDARD |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI |
                            /* SSEL is disabled */
                            IOCON_PIO_SSEL_DI);

    const uint32_t accelCsCfg = (UWB_ACCEL_CS_FUN |
                                 /* Selects pull-down function */
                                 IOCON_PIO_MODE_PULLDOWN |
                                 /* Standard mode, output slew rate control is disabled */
                                 IOCON_PIO_SLEW0_STANDARD |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables digital function */
                                 IOCON_PIO_DIGITAL_EN |
                                 /* Input filter disabled */
                                 IOCON_PIO_INPFILT_OFF |
                                 /* Standard mode, output slew rate control is disabled */
                                 IOCON_PIO_SLEW1_STANDARD |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI |
                                 /* SSEL is disabled */
                                 IOCON_PIO_SSEL_DI);

    gpio_pin_config_t paGpioCfg = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};

    gpio_pin_config_t vibAlertGpioCfg = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 0U};

    gpio_pin_config_t csGpioCfg  = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 1U};
    gpio_pin_config_t rstGpioCfg = {.pinDirection = kGPIO_DigitalOutput, .outputLogic = 1U};

    const uint32_t paCfg = (UWB_PA_ENABLE_FUN |
                            /* Selects no pull-down/pull-up function */
                            IOCON_PIO_MODE_INACT |
                            /* Standard mode, output slew rate control is disabled */
                            IOCON_PIO_SLEW0_STANDARD |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Standard mode, output slew rate control is disabled */
                            IOCON_PIO_SLEW1_STANDARD |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI |
                            /* SSEL is disabled */
                            IOCON_PIO_SSEL_DI);

    const uint32_t vibAlertCfg = (UWB_VIB_ALERT_FUN |
                                  /* Selects no pull-down/pull-up function */
                                  IOCON_PIO_MODE_INACT |
                                  /* Standard mode, output slew rate control is disabled */
                                  IOCON_PIO_SLEW0_STANDARD |
                                  /* Input function is not inverted */
                                  IOCON_PIO_INV_DI |
                                  /* Enables digital function */
                                  IOCON_PIO_DIGITAL_EN |
                                  /* Input filter disabled */
                                  IOCON_PIO_INPFILT_OFF |
                                  /* Standard mode, output slew rate control is disabled */
                                  IOCON_PIO_SLEW1_STANDARD |
                                  /* Open drain is disabled */
                                  IOCON_PIO_OPENDRAIN_DI |
                                  /* SSEL is disabled */
                                  IOCON_PIO_SSEL_DI);

    const uint32_t rstCfg = (UWB_RST_N_FUN |
                             /* Selects no pull-down/pull-up function */
                             IOCON_PIO_MODE_INACT |
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW0_STANDARD |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW1_STANDARD |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI |
                             /* SSEL is disabled */
                             IOCON_PIO_SSEL_DI);

