sridhar2rok/test/boards/QN9090_SR040_TR3_SPI/pin_mux.c
    const uint32_t rdyCfg = (UWB_RST_N_FUN |
                             /* Selects pull-up function */
                             IOCON_PIO_MODE_INACT |
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW0_STANDARD |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW1_STANDARD |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI |
                             /* SSEL is disabled */
                             IOCON_PIO_SSEL_DI);

    const uint32_t irqCfg = (UWB_HELIOS_IRQ_FUN |
                             /* Selects pull-up function */
                             IOCON_PIO_MODE_INACT |
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW0_STANDARD |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Standard mode, output slew rate control is disabled */
                             IOCON_PIO_SLEW1_STANDARD |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI |
                             /* SSEL is disabled */
                             IOCON_PIO_SSEL_DI);

    IOCON_PinMuxSet(IOCON, UWB_HELIOS_MOSI_PORT, UWB_HELIOS_MISO_PIN, misoCfg);
    IOCON_PinMuxSet(IOCON, UWB_HELIOS_MOSI_PORT, UWB_HELIOS_MOSI_PIN, mosiCfg);
    IOCON_PinMuxSet(IOCON, UWB_HELIOS_CS_PORT, UWB_HELIOS_CS_PIN, csCfg);
    IOCON_PinMuxSet(IOCON, UWB_HELIOS_CLK_PORT, UWB_HELIOS_CLK_PIN, sckCfg);
    IOCON_PinMuxSet(IOCON, UWB_HELIOS_IRQ_PORT, UWB_HELIOS_IRQ_PIN, irqCfg);

    IOCON_PinMuxSet(IOCON, UWB_ACCEL_CS_PORT, UWB_ACCEL_CS_PIN, accelCsCfg);

    GPIO_PinInit(UWB_PA_ENABLE_GPIO, UWB_PA_ENABLE_PORT, UWB_PA_ENABLE_PIN, &paGpioCfg);
    GPIO_PinInit(UWB_VIB_ALERT_GPIO, UWB_VIB_ALERT_PORT, UWB_VIB_ALERT_PIN, &vibAlertGpioCfg);
    GPIO_PinInit(UWB_HELIOS_CS_GPIO, UWB_HELIOS_CS_PORT, UWB_HELIOS_CS_PIN, &csGpioCfg);
    GPIO_PinInit(GPIO, UWB_RST_N_PORT, UWB_RST_N_PIN, &rstGpioCfg);

    IOCON_PinMuxSet(IOCON, UWB_PA_ENABLE_PORT, UWB_PA_ENABLE_PIN, paCfg);
    IOCON_PinMuxSet(IOCON, UWB_VIB_ALERT_PORT, UWB_VIB_ALERT_PIN, vibAlertCfg);

    IOCON_PinMuxSet(IOCON, UWB_RST_N_PORT, UWB_RST_N_PIN, rstCfg);
    IOCON_PinMuxSet(IOCON, UWB_RDY_N_PORT, UWB_RDY_N_PIN, rdyCfg);

    GPIO_PinWrite(GPIO, UWB_HELIOS_CS_PORT, UWB_HELIOS_CS_PIN, 1);
    GPIO_PinWrite(GPIO, UWB_RST_N_PORT, UWB_RST_N_PIN, 1);
}

void BOARD_InitBuzzerPins()
{
    const uint32_t buzzerCfg = (BUZZER_FUN |
                                /* Selects pull-up function */
                                IOCON_PIO_MODE_PULLUP |
                                /* Standard mode, output slew rate control is disabled */
                                IOCON_PIO_SLEW0_STANDARD |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is disabled */
                                IOCON_PIO_SLEW1_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI |
                                /* SSEL is disabled */
                                IOCON_PIO_SSEL_DI);

    /* PORT0 PIN3 (coords: 6) is configured as PWM3 */
    IOCON_PinMuxSet(IOCON, BUZZER_PORT, BUZZER_PIN, buzzerCfg);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_DeInitDebugUARTPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '13', peripheral: GPIO, signal: 'PIO0, 10', pin_signal: PIO0_10/CT32B0_CAP0/USART1_TXD/RFTX/I2C0_SCL/SPI0_SCK/PDM0_DATA, direction: INPUT, invert: disabled,
    open_drain: disabled, filter_off: disabled, egp: gpio, ecs: disabled, ehs: low, fsel: disabled, io_clamp: disabled}
  - {pin_num: '14', peripheral: GPIO, signal: 'PIO0, 11', pin_signal: PIO0_11/CT32B1_CAP0/USART1_RXD/RFRX/I2C0_SDA/SPI0_MISO/PDM0_CLK, direction: INPUT, invert: disabled,
    open_drain: disabled, filter_off: disabled, egp: gpio, ecs: disabled, ehs: low, fsel: disabled, io_clamp: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DeInitDebugUARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void BOARD_DeInitDebugUARTPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t DBG_UART_TX_config = {.pinDirection = kGPIO_DigitalInput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_10 (pin 13)  */
    GPIO_PinInit(BOARD_DEINITDEBUGUARTPINS_DBG_UART_TX_GPIO,
        BOARD_DEINITDEBUGUARTPINS_DBG_UART_TX_PORT,
        BOARD_DEINITDEBUGUARTPINS_DBG_UART_TX_PIN,
        &DBG_UART_TX_config);

    gpio_pin_config_t DBG_UART_RX_config = {.pinDirection = kGPIO_DigitalInput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_11 (pin 14)  */
    GPIO_PinInit(BOARD_DEINITDEBUGUARTPINS_DBG_UART_RX_GPIO,
        BOARD_DEINITDEBUGUARTPINS_DBG_UART_RX_PORT,
        BOARD_DEINITDEBUGUARTPINS_DBG_UART_RX_PIN,
        &DBG_UART_RX_config);

    const uint32_t DBG_UART_TX = (/* Pin is configured as PIO0_10 */
        IOCON_PIO_FUNC0 |
        /* GPIO mode */
        IOCON_PIO_EGP_GPIO |
        /* IO is an open drain cell */
        IOCON_PIO_ECS_DI |
        /* High speed IO for GPIO mode, IIC not */
        IOCON_PIO_EHS_DI |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* IIC mode:Noise pulses below approximately 50ns are filtered out. GPIO mode:a 3ns filter */
        IOCON_PIO_FSEL_DI |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* IO_CLAMP disabled */
        IOCON_PIO_IO_CLAMP_DI);
    /* PORT0 PIN10 (coords: 13) is configured as PIO0_10 */
    IOCON_PinMuxSet(
        IOCON, BOARD_DEINITDEBUGUARTPINS_DBG_UART_TX_PORT, BOARD_DEINITDEBUGUARTPINS_DBG_UART_TX_PIN, DBG_UART_TX);

    const uint32_t DBG_UART_RX = (/* Pin is configured as PIO0_11 */
        IOCON_PIO_FUNC0 |
        /* GPIO mode */
        IOCON_PIO_EGP_GPIO |
        /* IO is an open drain cell */
        IOCON_PIO_ECS_DI |
        /* High speed IO for GPIO mode, IIC not */
        IOCON_PIO_EHS_DI |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* IIC mode:Noise pulses below approximately 50ns are filtered out. GPIO mode:a 3ns filter */
        IOCON_PIO_FSEL_DI |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* IO_CLAMP disabled */
        IOCON_PIO_IO_CLAMP_DI);
    /* PORT0 PIN11 (coords: 14) is configured as PIO0_11 */
    IOCON_PinMuxSet(
        IOCON, BOARD_DEINITDEBUGUARTPINS_DBG_UART_RX_PORT, BOARD_DEINITDEBUGUARTPINS_DBG_UART_RX_PIN, DBG_UART_RX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWDPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '15', peripheral: SWD, signal: SWCLK, pin_signal: PIO0_12/IR_BLASTER/SWCLK/PWM0/I2C1_SCL/SPI0_MOSI/ANA_COMP_OUT, mode: inactive, invert: disabled, open_drain: disabled,
    filter_off: disabled, slew_rate_0: standard, slew_rate_1: standard, ssel: disabled}
  - {pin_num: '16', peripheral: SWD, signal: SWDIO, pin_signal: PIO0_13/SPI1_SSELN2/SWDIO/PWM2/I2C1_SDA/SPI0_SSELN, mode: inactive, invert: disabled, open_drain: disabled,
    filter_off: disabled, slew_rate_0: standard, slew_rate_1: standard, ssel: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

