sridhar2rok/test/boards/QN9090_SR040_TR3_SPI/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DeInitAppUARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void BOARD_DeInitAppUARTPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t APP_UART_TX_config = {.pinDirection = kGPIO_DigitalInput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_8 (pin 11)  */
    GPIO_PinInit(BOARD_DEINITAPPUARTPINS_APP_UART_TX_GPIO,
        BOARD_DEINITAPPUARTPINS_APP_UART_TX_PORT,
        BOARD_DEINITAPPUARTPINS_APP_UART_TX_PIN,
        &APP_UART_TX_config);

    gpio_pin_config_t APP_UART_RX_config = {.pinDirection = kGPIO_DigitalInput, .outputLogic = 0U};
    /* Initialize GPIO functionality on pin PIO0_9 (pin 12)  */
    GPIO_PinInit(BOARD_DEINITAPPUARTPINS_APP_UART_RX_GPIO,
        BOARD_DEINITAPPUARTPINS_APP_UART_RX_PORT,
        BOARD_DEINITAPPUARTPINS_APP_UART_RX_PIN,
        &APP_UART_RX_config);

    const uint32_t APP_UART_TX = (/* Pin is configured as PIO0_8 */
        IOCON_PIO_FUNC0 |
        /* Selects pull-up function */
        IOCON_PIO_MODE_PULLUP |
        /* Standard mode, output slew rate control is disabled */
        IOCON_PIO_SLEW0_STANDARD |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Standard mode, output slew rate control is disabled */
        IOCON_PIO_SLEW1_STANDARD |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN8 (coords: 11) is configured as PIO0_8 */
    IOCON_PinMuxSet(
        IOCON, BOARD_DEINITAPPUARTPINS_APP_UART_TX_PORT, BOARD_DEINITAPPUARTPINS_APP_UART_TX_PIN, APP_UART_TX);

    const uint32_t APP_UART_RX = (/* Pin is configured as PIO0_9 */
        IOCON_PIO_FUNC0 |
        /* Selects pull-up function */
        IOCON_PIO_MODE_PULLUP |
        /* Standard mode, output slew rate control is disabled */
        IOCON_PIO_SLEW0_STANDARD |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Standard mode, output slew rate control is disabled */
        IOCON_PIO_SLEW1_STANDARD |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN9 (coords: 12) is configured as PIO0_9 */
    IOCON_PinMuxSet(
        IOCON, BOARD_DEINITAPPUARTPINS_APP_UART_RX_PORT, BOARD_DEINITAPPUARTPINS_APP_UART_RX_PIN, APP_UART_RX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIFIPins:
- options: {callFromInitBoot: 'false', coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: '22', peripheral: SPIFI, signal: CLK, pin_signal: PIO0_18/SPI1_MISO/ISO7816_IO/CT32B0_MAT1/PWM7/USART0_TXD/SPIFI_CLK/ADC0_4, mode: inactive, invert: disabled,
    open_drain: disabled, filter_off: disabled, slew_rate_0: fast, slew_rate_1: fast, ssel: disabled}
  - {pin_num: '19', peripheral: SPIFI, signal: CSN, pin_signal: PIO0_16/SPI1_SSELN0/ISO7816_RST/PWM5/I2C0_SDA/PDM1_CLK/SPIFI_CSN/ADC0_2, mode: pullUp, invert: disabled,
    open_drain: disabled, filter_off: disabled, slew_rate_0: fast, slew_rate_1: fast, ssel: disabled}
  - {pin_num: '24', peripheral: SPIFI, signal: 'SPIFI_IO, 2', pin_signal: PIO0_20/IR_BLASTER/USART1_TXD/PWM8/RFTX/SPIFI_IO2/ACP, mode: inactive, invert: disabled,
    open_drain: disabled, filter_off: disabled, slew_rate_0: fast, slew_rate_1: fast, ssel: disabled}
  - {pin_num: '21', peripheral: SPIFI, signal: 'SPIFI_IO, 3', pin_signal: PIO0_17/SPI1_MOSI/ISO7816_CLK/SWO/PWM6/CLK_OUT/SPIFI_IO3/ADC0_3, mode: inactive, invert: disabled,
    open_drain: disabled, filter_off: disabled, slew_rate_0: fast, slew_rate_1: fast, ssel: disabled}
  - {pin_num: '23', peripheral: SPIFI, signal: SPIFI_IO0_or_SPIFI_MOSI, pin_signal: PIO0_19/ADO/USART1_RXD/CLK_IN/PWM4/USART0_RXD/SPIFI_IO0/ADC0_5, mode: inactive,
    invert: disabled, open_drain: disabled, filter_off: disabled, slew_rate_0: fast, slew_rate_1: fast, ssel: disabled}
  - {pin_num: '25', peripheral: SPIFI, signal: SPIFI_IO1_or_SPIFI_MISO, pin_signal: PIO0_21/IR_BLASTER/USART1_SCK/PWM9/RFRX/SWO/SPIFI_IO1/ACM, mode: inactive, invert: disabled,
    open_drain: disabled, filter_off: disabled, slew_rate_0: fast, slew_rate_1: fast, ssel: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPIFIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4 */
void BOARD_InitSPIFIPins(void)
{
    /* Enables the clock for the I/O controller block. 0: Disable. 1: Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t port0_pin16_config = (/* Pin is configured as SPIFI_CSN */
        IOCON_PIO_FUNC7 |
        /* Selects pull-up function */
        IOCON_PIO_MODE_PULLUP |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW0_FAST |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW1_FAST |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN16 (coords: 19) is configured as SPIFI_CSN */
    IOCON_PinMuxSet(IOCON, 0U, 16U, port0_pin16_config);

    const uint32_t port0_pin17_config = (/* Pin is configured as SPIFI_IO3 */
        IOCON_PIO_FUNC7 |
        /* No addition pin function */
        IOCON_PIO_MODE_INACT |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW0_FAST |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW1_FAST |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN17 (coords: 21) is configured as SPIFI_IO3 */
    IOCON_PinMuxSet(IOCON, 0U, 17U, port0_pin17_config);

    const uint32_t port0_pin18_config = (/* Pin is configured as SPIFI_CLK */
        IOCON_PIO_FUNC7 |
        /* No addition pin function */
        IOCON_PIO_MODE_INACT |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW0_FAST |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW1_FAST |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN18 (coords: 22) is configured as SPIFI_CLK */
    IOCON_PinMuxSet(IOCON, 0U, 18U, port0_pin18_config);

    const uint32_t port0_pin19_config = (/* Pin is configured as SPIFI_IO0 */
        IOCON_PIO_FUNC7 |
        /* No addition pin function */
        IOCON_PIO_MODE_INACT |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW0_FAST |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW1_FAST |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN19 (coords: 23) is configured as SPIFI_IO0 */
    IOCON_PinMuxSet(IOCON, 0U, 19U, port0_pin19_config);

