sridhar2rok/test/boards/QN9090_SR040_TR3_SPI/pin_mux.c
    const uint32_t port0_pin20_config = (/* Pin is configured as SPIFI_IO2 */
        IOCON_PIO_FUNC7 |
        /* No addition pin function */
        IOCON_PIO_MODE_INACT |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW0_FAST |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW1_FAST |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN20 (coords: 24) is configured as SPIFI_IO2 */
    IOCON_PinMuxSet(IOCON, 0U, 20U, port0_pin20_config);

    const uint32_t port0_pin21_config = (/* Pin is configured as SPIFI_IO1 */
        IOCON_PIO_FUNC7 |
        /* No addition pin function */
        IOCON_PIO_MODE_INACT |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW0_FAST |
        /* Input function is not inverted */
        IOCON_PIO_INV_DI |
        /* Enables digital function */
        IOCON_PIO_DIGITAL_EN |
        /* Input filter disabled */
        IOCON_PIO_INPFILT_OFF |
        /* Fast mode, slew rate control is enabled */
        IOCON_PIO_SLEW1_FAST |
        /* Open drain is disabled */
        IOCON_PIO_OPENDRAIN_DI |
        /* SSEL is disabled */
        IOCON_PIO_SSEL_DI);
    /* PORT0 PIN21 (coords: 25) is configured as SPIFI_IO1 */
    IOCON_PinMuxSet(IOCON, 0U, 21U, port0_pin21_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
